<a href="https://colab.research.google.com/github/YahiaML/SQL_Udacity_Course/blob/main/Unit_1_Basic_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('/content/parch_and_posey.db')

# **L_1:** SELECT FROM

**SELECT:** choose the columns that you want

**FROM:** choose the table that contains the columns that you want

In [14]:
SQL_code = '''

SELECT * 
FROM accounts
LIMIT 15;
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)
(1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510)
(1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520)
(1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530)
(1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)
(1051, 'UnitedHealth Group', 'www.unitedhealthgroup.com', 40.08792542, -75.57569396, 'Savanna Gayman', 321550)
(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560)
(1071, 'General Motors', 'www.gm.com', 40.80551762, -76.7101814, 'Barrie Omeara', 321570)
(1081, 'Ford Motor', 'www.ford.com', 41.113942, -75.85422452, 'Kym Hagerman', 321580)
(1091, 'AT&ampT', 'www.att.com', 42.4974627, -74.90271225, 'Jamel Mosqueda', 321590)
(1101, 'General Electric', 'www.ge.com', 41.1697121, -77.29713174, 'Parker Hoggan', 321600)
(1111, 'AmerisourceBergen', 'www.amerisourcebergen.com', 41.91146908, -74.4762077, 'Tuan Trainer', 321610)
(1121, 'Verizon', 'www.verizon.com', 41.3414106, -75.77193559, 'Chantell Drescher', 321620)
(1131, 'Chevron', 'www.chevron.com', 42.6119413, -76.36123105, 'Paige Bartos', 321630)
(1141, 'Costco', 'www.costco.com', 42.26304566, -74.80916921, 'Dominique Favela', 321640)

# **L_2:** LIMIT
Only show the first x rows

In [8]:
sql_code = db.execute('''
SELECT occurred_at, account_id, channel
FROM web_events
LIMIT 15;
''')

# print output as a table (data frame)
data = []
for row in sql_code:
  data.append(list(row))
df= pd.DataFrame(data,columns=["occurred_at","account_id", "channel"])  # inset columns names that you want
df

            occurred_at  account_id channel
0   2015-10-06 17:13:58        1001  direct
1   2015-11-05 03:08:26        1001  direct
2   2015-12-04 03:57:24        1001  direct
3   2016-01-02 00:55:03        1001  direct
4   2016-02-01 19:02:33        1001  direct
5   2016-03-02 15:15:22        1001  direct
6   2016-04-01 10:58:55        1001  direct
7   2016-05-01 15:26:44        1001  direct
8   2016-05-31 20:53:47        1001  direct
9   2016-06-30 12:09:45        1001  direct
10  2016-07-30 03:06:26        1001  direct
11  2016-08-28 06:42:42        1001  direct
12  2016-09-26 23:14:59        1001  direct
13  2016-10-26 20:21:09        1001  direct
14  2016-11-25 22:52:29        1001  direct

# **L_3:** ORDER BY & ORDER BY X DESC
**ORDER BY:** Used to arrange the outputs ascendingly according to column X

**ORDER BY X DESC:** Used to arrange the outputs descendingly according to column X

In [15]:
SQL_code = '''
SELECT id, occurred_at, total_amt_usd
FROM orders 
ORDER BY occurred_at
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(5786, '2013-12-04 04:22:44', 627.48)
(2415, '2013-12-04 04:45:54', 2646.77)
(4108, '2013-12-04 04:53:25', 2709.62)
(4489, '2013-12-05 20:29:16', 277.13)
(287, '2013-12-05 20:33:56', 3001.85)
(1946, '2013-12-06 02:13:20', 2802.9)
(6197, '2013-12-06 12:55:22', 7009.18)
(3122, '2013-12-06 12:57:41', 1992.13)
(6078, '2013-12-06 13:14:47', 6680.06)
(2932, '2013-12-06 13:17:25', 2075.94)

In [16]:
SQL_code = '''
SELECT id, occurred_at, total_amt_usd
FROM orders 
ORDER BY occurred_at DESC
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(6451, '2017-01-02 00:02:40', 6451.76)
(3546, '2017-01-01 23:50:16', 1932.85)
(6454, '2017-01-01 22:29:50', 1854.57)
(3554, '2017-01-01 22:17:26', 2666.79)
(6556, '2017-01-01 21:04:25', 892.85)
(3745, '2017-01-01 20:52:23', 2582.4)
(1092, '2017-01-01 17:34:10', 1525.98)
(1364, '2017-01-01 16:40:57', 1036.57)
(3159, '2017-01-01 14:05:39', 1870.35)
(6223, '2017-01-01 13:57:21', 4676.25)